Hey @TomTucka I was unable to reproduce your error using the latest versions or the versions you specified:

```
$ ./boundary version

Version information:
  Build Date:          2023-07-14T13:03:00Z
  Git Revision:        db01791662a7126fbf4ea0a27b23b70acd20b17b
  Version Number:      0.13.1

$ ./boundary dev
```

I then took your `tf` file and everything worked fine. I am running on Mac AMD64 what is your enviornment

```
$ terraform init

Initializing the backend...

Initializing provider plugins...
- Finding hashicorp/boundary versions matching "1.1.9"...
- Finding hashicorp/random versions matching "3.5.1"...
- Finding hashicorp/tls versions matching "4.0.4"...
- Installing hashicorp/boundary v1.1.9...
- Installed hashicorp/boundary v1.1.9 (signed by HashiCorp)
- Installing hashicorp/random v3.5.1...
- Installed hashicorp/random v3.5.1 (signed by HashiCorp)
- Installing hashicorp/tls v4.0.4...
- Installed hashicorp/tls v4.0.4 (signed by HashiCorp)

Terraform has created a lock file .terraform.lock.hcl to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.

$ terraform apply
random_id.id: Refreshing state... [id=Gt6tFA]
tls_private_key.training: Refreshing state... [id=658e7e02ae083e2f59e59c730e3b784bb15c3fdb]
boundary_scope.platform: Refreshing state... [id=o_0T9bPGHc8V]
boundary_scope.global: Refreshing state... [id=global]
boundary_scope.platform_proj: Refreshing state... [id=p_PVK38t34Sq]
boundary_credential_store_static.store: Refreshing state... [id=csst_usMVXdy7Jg]
boundary_credential_ssh_private_key.store_key: Refreshing state... [id=credspk_kSpnANvV0H]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the last "terraform apply" which may have affected this plan:

  # boundary_credential_store_static.store has been deleted
  - resource "boundary_credential_store_static" "store" {
      - id          = "csst_usMVXdy7Jg" -> null
        name        = "static_credential_store"
        # (2 unchanged attributes hidden)
    }

  # boundary_scope.platform has been deleted
  - resource "boundary_scope" "platform" {
      - id                       = "o_0T9bPGHc8V" -> null
        name                     = "Platform Engineering"
        # (4 unchanged attributes hidden)
    }

  # boundary_scope.platform_proj has been deleted
  - resource "boundary_scope" "platform_proj" {
      - id                     = "p_PVK38t34Sq" -> null
        name                   = "Platform Project One"
        # (3 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the relevant attributes using ignore_changes, the following plan may include actions to undo or
respond to these changes.

─────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # boundary_credential_ssh_private_key.store_key will be created
  + resource "boundary_credential_ssh_private_key" "store_key" {
      + credential_store_id         = (known after apply)
      + description                 = "Our first ssh private key credential!"
      + id                          = (known after apply)
      + name                        = "training_ssh_private_key"
      + private_key                 = (sensitive value)
      + private_key_hmac            = (known after apply)
      + private_key_passphrase_hmac = (known after apply)
      + username                    = "ec2-user"
    }

  # boundary_credential_store_static.store will be created
  + resource "boundary_credential_store_static" "store" {
      + description = "Our first static credential store"
      + id          = (known after apply)
      + name        = "static_credential_store"
      + scope_id    = (known after apply)
    }

  # boundary_scope.global will be updated in-place
  ~ resource "boundary_scope" "global" {
      - description  = "Global Scope" -> null
        id           = "global"
      - name         = "global" -> null
        # (2 unchanged attributes hidden)
    }

  # boundary_scope.platform will be created
  + resource "boundary_scope" "platform" {
      + auto_create_admin_role   = true
      + auto_create_default_role = true
      + description              = "Platform Engineering Team"
      + id                       = (known after apply)
      + name                     = "Platform Engineering"
      + scope_id                 = "global"
    }

  # boundary_scope.platform_proj will be created
  + resource "boundary_scope" "platform_proj" {
      + auto_create_admin_role = true
      + description            = "Platform Scope"
      + id                     = (known after apply)
      + name                   = "Platform Project One"
      + scope_id               = (known after apply)
    }

Plan: 4 to add, 1 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

boundary_scope.platform: Creating...
boundary_scope.global: Modifying... [id=global]
boundary_scope.platform: Creation complete after 0s [id=o_FxPOAVrX1e]
boundary_scope.global: Modifications complete after 0s [id=global]
boundary_scope.platform_proj: Creating...
boundary_scope.platform_proj: Creation complete after 0s [id=p_DFG5BHssuU]
boundary_credential_store_static.store: Creating...
boundary_credential_store_static.store: Creation complete after 0s [id=csst_stA27ywmv8]
boundary_credential_ssh_private_key.store_key: Creating...
boundary_credential_ssh_private_key.store_key: Creation complete after 0s [id=credspk_FGcIcH3nGD]

Apply complete! Resources: 4 added, 1 changed, 0 destroyed.

Outputs:

private_key = <sensitive>
```